<?php

$a=['D'=>'國文',
    'B'=>'英文',
    'A'=>'數學',
    'C'=>'地理',
    'E'=>'歷史'];
    print_r($a);
    echo "<br>";
    sort($a);
    print_r($a);
    echo "<br>";

?>
<?php

$a=['D'=>'2',
    'B'=>'4',
    'A'=>'5',
    'C'=>'1',
    'E'=>'3'];
    print_r($a);
    echo "<br>";
    sort($a);
    print_r($a);
    echo "<br>";

?>

<h3>implode()</h3>
<?php
$a=['D'=>'國文',
'B'=>'英文',
'A'=>'數學',
'C'=>'地理',
'E'=>'歷史'];

$result=implode(',',$a);

echo $result;


print_r(explode(',',$result));

?>

<hr>

<h1>成績陣列 寫法一</h1>
<?php

$score=["judy" =>['國文' => 95, '英文' => 64, '數學' => 70, '地理' => 90,'歷史' => 84],
"amo" =>['國文' =>88, '英文' =>78, '數學' =>54, '地理' =>81,'歷史' =>71],
"John" =>['國文' =>45, '英文' =>60, '數學' =>68, '地理' =>70,'歷史' =>62],
"Peter" =>['國文' =>53, '英文' =>32, '數學' =>77, '地理' =>54,'歷史' =>42],
"Hebe" =>['國文' =>71, '英文' =>62, '數學' =>80, '地理' =>62,'歷史' =>64]];

print_r($score["Peter"]["歷史"]);

?>

<hr>

<h1>成績陣列 寫法二</h1>
<?php

$score=["國文"=>["Judy"=>95,"amo" =>88, "John"=>45,"Peter"=>59,"Hebe"=>71],
        "英文"=>["Judy"=>64,"amo" =>78, "John"=>60,"Peter"=>32,"Hebe"=>62],
        "數學"=>["Judy"=>70,"amo" =>54, "John"=>68,"Peter"=>77,"Hebe"=>80],
        "地理"=>["Judy"=>90,"amo" =>81, "John"=>70,"Peter"=>54,"Hebe"=>62],
        "歷史"=>["Judy"=>84,"amo" =>71, "John"=>62,"Peter"=>42,"Hebe"=>64]];

print_r($score["歷史"]["amo"]);

?>

<hr>

<h1>成績陣列 寫法三(一維)</h1>

<?php
$judy=['國文' => 95, '英文' => 64, '數學' => 70, '地理' => 90,'歷史' => 84];
$amo=['國文' =>88, '英文' =>78, '數學' =>54, '地理' =>81,'歷史' =>71];

print_r($judy["數學"]);

?>





